# selection perticular part

In [2]:
import numpy as np 
import pandas as pd

In [3]:

data = {
    'EMP_id': range(1, 21),

    'Name': [
        'kaushik','kanji','ram','raj','janvi','dharuvi','kinjal','diya',
        'darshna','sneha','komal','daxa','ajay','rakesh','jayesh',
        'shayam','ramesh','yogita','yash','yogesh'
    ],

    'Age': np.random.randint(20, 45, 20),

    'Department': [
        'IT','HR','ACCOUNT','FINANCE','IT','HR','IT','HR',
        'ACCOUNT','FINANCE','FINANCE','IT','HR','ACCOUNT',
        'FINANCE','IT','HR','ACCOUNT','FINANCE','IT'
    ],

    'Salary': np.random.randint(50000, 150000, 20),

    'City': [
        'Ahmedabad','Pune','Vadodara','Delhi','Jamnagar','Veraval',
        'Rajkot','Mumbai','Udaipur','Gandhinagar','Junagadh','Surat',
        'Vapi','Banaskantha','Jamnagar','Veraval','Rajkot','Mumbai',
        'Udaipur','Amreli'
    ]
}

df = pd.DataFrame(data)
print(df)

    EMP_id     Name  Age Department  Salary         City
0        1  kaushik   31         IT  149278    Ahmedabad
1        2    kanji   21         HR   68830         Pune
2        3      ram   20    ACCOUNT   93937     Vadodara
3        4      raj   36    FINANCE  102673        Delhi
4        5    janvi   34         IT  128337     Jamnagar
5        6  dharuvi   42         HR   61684      Veraval
6        7   kinjal   44         IT  124372       Rajkot
7        8     diya   25         HR  149735       Mumbai
8        9  darshna   31    ACCOUNT   79920      Udaipur
9       10    sneha   27    FINANCE   94066  Gandhinagar
10      11    komal   31    FINANCE   92875     Junagadh
11      12     daxa   27         IT   98666        Surat
12      13     ajay   32         HR  112147         Vapi
13      14   rakesh   35    ACCOUNT   88140  Banaskantha
14      15   jayesh   35    FINANCE  144095     Jamnagar
15      16   shayam   23         IT   98868      Veraval
16      17   ramesh   31         HR   63687       Rajkot
17      18   yogita   29    ACCOUNT  133219       Mumbai
18      19     yash   35    FINANCE   87485      Udaipur
19      20   yogesh   39         IT  124683       Amreli

In [4]:
df.loc[[0,1]]

   EMP_id     Name  Age Department  Salary       City
0       1  kaushik   31         IT  149278  Ahmedabad
1       2    kanji   21         HR   68830       Pune

In [ ]:
total = df.loc[[0,1]]['Salary']
print(np.sum(total))

218108

# select perticular part

In [7]:
df.loc[[0,1,2]][['Department','Salary']]

  Department  Salary
0         IT  149278
1         HR   68830
2    ACCOUNT   93937

In [8]:
df.loc[[1,2,3]]

   EMP_id   Name  Age Department  Salary      City
1       2  kanji   21         HR   68830      Pune
2       3    ram   20    ACCOUNT   93937  Vadodara
3       4    raj   36    FINANCE  102673     Delhi

In [9]:
df.loc[[2,3]][['Name','Age']]

  Name  Age
2  ram   20
3  raj   36